{
  "blogs": [
    {
      "author": "Magnus",
      "id": 1,
      "title": "Art of living",
      "body": " three-year program to rejuvenate the Kumudavathi River (in Bangalore) was initiated by the foundation under its 'Volunteer for Better India' campaign in collaboration with civic authorities and environmentalists in February 2013.The project aims to address the water shortage problems through rainwater harvesting, increasing green cover and de-silting existing step wells, among other methods. Volunteers join the villagers every Sunday to participate in these activities under guidance of a geological scientist.[31][32] To create awareness about this program, Art of Living founder Ravi Shankar, joined by other NGOs, prominent citizens, civic authorities, farmers and volunteers led a walkathon in Bangalore City.[33] Apart from reviving some water bodies used by birds and animals,[34] the project had revived five water-recharge wells, constructed 74 boulder checks, cleaned up 18 step wells and planted 2,350 saplings in seven villages by June 2014.[35] Similar efforts were held to revive Pallar River in Andhra Pradesh, Manjra river in Maharashtra,[36] and Vedavathi River in Karnataka."
    },
    {
      "author": "Karl",
      "id": 2,
      "title": "Internet Of Today",
      "body": "Today's Internet operates over the common network layer datagram protocol, Internet Protocol version 4 (IPv4). In the early 1990s, a new design of addressing scheme was initiated within the Internet Engineering Task Force (IETF) due to the recognized weaknesses of IPv4. The result was IPv6 (see Figure 14.7). The single most significant advantage IPv6 offers is increased destination and source addresses. IPv6 quadruples the number of network address bits from 32 bits in IPv4 to 128 bits, which provides more than enough globally unique IP addresses for every network device on the planet. This will lead to network simplification, first, through less need to maintain a routing state within the network and second, through reduced need for address translation; hence, it will improve the scalability of the Internet. IPv6 will allow a return to a global end-to-end environment where the addressing rules of the network are transparent to applications. The current IP address space is unable to satisfy the potentially large increase in number of users or the geographical needs of Internet expansion, let alone the requirements of emerging applications such as Internet-enabled personal digital assistants (PDAs), personal area networks (PANs), Internet-connected transportation, integrated telephony services, and distributed gaming."
    },
    {
      "author": "Fritz",
      "id": 3,
      "title": "Biowarfare",
      "body": "Biological warfare, also known as germ warfare, is the use of biological toxins or infectious agents such as bacteria, viruses, insects, and fungi with the intent to kill, harm or incapacitate humans, animals or plants as an act of war. Biological weapons (often termed 'bio-weapons', 'biological threat agents', or 'bio-agents') are living organisms or replicating entities ( ⁠i.e. viruses, which are not universally considered 'alive'). Entomological (insect) warfare is a subtype of biological warfare. Offensive biological warfare is prohibited under customary international humanitarian law and several international treaties.[1][2] In particular, the 1972 Biological Weapons Convention (BWC) bans the development, production, acquisition, transfer, stockpiling and use of biological weapons.[3] Therefore, the use of biological agents in armed conflict is a war crime.[4] In contrast, defensive biological research for prophylactic, protective or other peaceful purposes is not prohibited by the BWC.[5] Biological warfare is distinct from warfare involving other types of weapons of mass destruction (WMD), including nuclear warfare, chemical warfare, and radiological warfare. None of these are considered conventional weapons, which are deployed primarily for their explosive, kinetic, or incendiary potential. Biological weapons may be employed in various ways to gain a strategic or tactical advantage over the enemy, either by threats or by actual deployments. Like some chemical weapons, biological weapons may also be useful as area denial weapons. These agents may be lethal or non-lethal, and may be targeted against a single individual, a group of people, or even an entire population. They may be developed, acquired, stockpiled or deployed by nation states or by non-national groups. In the latter case, or if a nation-state uses it clandestinely, it may also be considered bioterrorism.[6]Biological warfare and chemical warfare overlap to an extent, as the use of toxins produced by some living organisms is considered under the provisions of both the BWC and the Chemical Weapons Convention. Toxins and psychochemical weapons are often referred to as midspectrum agents. Unlike bioweapons, these midspectrum agents do not reproduce in their host and are typically characterized by shorter incubation periods.[7]"
    },
    {
      "author": "Fritz",
      "id": 4,
      "title": "Black Death",
      "body": "The Black Death was a devastating global epidemic of bubonic plague that struck Europe and Asia in the mid-1300s. The plague arrived in Europe in October 1347, when 12 ships from the Black Sea docked at the Sicilian port of Messina. People gathered on the docks were met with a horrifying surprise: Most sailors aboard the ships were dead, and those still alive were gravely ill and covered in black boils that oozed blood and pus. Sicilian authorities hastily ordered the fleet of “death ships” out of the harbor, but it was too late: Over the next five years, the Black Death would kill more than 20 million people in Europe—almost one-third of the continent’s population. Because they did not understand the biology of the disease, many people believed that the Black Death was a kind of divine punishment—retribution for sins against God such as greed, blasphemy, heresy, fornication and worldliness. By this logic, the only way to overcome the plague was to win God’s forgiveness. Some people believed that the way to do this was to purge their communities of heretics and other troublemakers—so, for example, many thousands of Jews were massacred in 1348 and 1349. (Thousands more fled to the sparsely populated regions of Eastern Europe, where they could be relatively safe from the rampaging mobs in the cities.)"
    },
    {
      "title": "Nuclear Fisson",
      "body": "Origin of Nuclear Instability\nWithin the nucleus, there are diﬀerent forces that act between the particles. The strong nuclear force is the force between two or more nucleons. This force binds protons and neutrons together inside the nucleus, and it is most powerful when the nucleus is small and the nucleons are close together. The electromagnetic force causes the repulsion between like-charged protons. These two forces produce opposite eﬀects in the nucleus. The strong nuclear force acts to hold all the protons and neutrons close together, while the electromagnetic force acts to push protons further apart.\n\nIn atoms with small nuclei, the strong nuclear force overpowers the electromagnetic force. As the nucleus gets bigger, the electromagnetic force becomes greater than the strong nuclear force. In these nuclei, it’s possible for particles and energy to be ejected from the nucleus. These nuclei are called unstable, and this instability can result in radiation and fission.\n\nNeutron Bombardment\nIn order to initiate fission, a high-energy neutron is directed towards a nucleus, such as 235U. The combination of these two produces 236U, which is an unstable element that undergoes fission. The resulting fission process often releases additional neutrons, which can go on to initiate other 235U atoms, forming a chain reaction. While nuclear fission can occur without this neutron bombardment, in what would be termed spontaneous fission, this is a rare occurrence; most fission reactions, especially those utilized for energy and weaponry, occur via neutron bombardment. If an element can be induced to undergo fission via neutron bombardment, it is said to be fissile .\n\nNuclear fission of U-235If U-235 is bombarded with a neutron (light blue small circe), the resulting U-236 produced is unstable and undergoes fission. The resulting elements (shown here as Kr-92 and Ba-141) do not contain as many nucleons as U-236, with the remaining three neutrons being released as high-energy particles, able to bombard another U-235 atom and maintain a chain reaction.\n",
      "author": "Scoutmen4Real",
      "id": 5
    },
    {
      "title": "Bipolar Transistor",
      "body": "The word Transistor is a combination of the two words Transfer Varistor which describes their mode of operation way back in their early days of electronics development. There are two basic types of bipolar transistor construction, PNP and NPN, which basically describes the physical arrangement of the P-type and N-type semiconductor materials from which they are made.\n\nThe Bipolar Transistor basic construction consists of two PN-junctions producing three connecting terminals with each terminal being given a name to identify it from the other two. These three terminals are known and labelled as the Emitter ( E ), the Base ( B ) and the Collector ( C ) respectively.\n\nBipolar Transistors are current regulating devices that control the amount of current flowing through them from the Emitter to the Collector terminals in proportion to the amount of biasing voltage applied to their base terminal, thus acting like a current-controlled switch. As a small current flowing into the base terminal controls a much larger collector current forming the basis of transistor action.\n\nThe principle of operation of the two transistor types PNP and NPN, is exactly the same the only difference being in their biasing and the polarity of the power supply for each type.",
      "author": "SuperDude420",
      "id": 6
    },
    {
      "title": "Isotopes of carbon",
      "body": "Carbon (6C) has 15 known isotopes, from 8C to 22C, of which 12C and 13C are stable. The longest-lived radioisotope is 14C, with a half-life of 5,730 years. This is also the only carbon radioisotope found in nature—trace quantities are formed cosmogenically by the reaction 14N + 1n → 14C + 1H. The most stable artificial radioisotope is 11C, which has a half-life of 20.364 minutes. All other radioisotopes have half-lives under 20 seconds, most less than 200 milliseconds. The least stable isotope is 8C, with a half-life of 2.0 x 10−21 s. 12C and 13C are measured as the isotope ratio δ13C in benthic foraminifera and used as a proxy for nutrient cycling and the temperature dependent air-sea exchange of CO2 (ventilation) (Lynch-Stieglitz et al., 1995). Plants find it easier to use the lighter isotopes (12C) when they convert sunlight and carbon dioxide into food. So, for example, large blooms of plankton (free-floating organisms) absorb large amounts of 12C from the oceans. Originally, the 12C was mostly incorporated into the seawater from the atmosphere. If the oceans that the plankton live in are stratified (meaning that there are layers of warm water near the top, and colder water deeper down), then the surface water does not mix very much with the deeper waters, so that when the plankton dies, it sinks and takes away 12C from the surface, leaving the surface layers relatively rich in 13C. Where cold waters well up from the depths (such as in the North Atlantic), the water carries 12C back up with it. So, when the ocean was less stratified than today, there was much more 12C in the skeletons of surface-dwelling species. Other indicators of past climate include the presence of tropical species, coral growths rings, etc.[6]",
      "author": "SuperDude420",
      "id": 7
    }
  ]
}